rottenpotatoes/app/controllers/movies_controller.rb

  def find_with_same_director
      id = params[:id] # retrieve movie ID from URI route
      @movie = Movie.find(id) # look up movie by unique ID
      if !@movie.director || @movie.director == ''
        flash[:notice] = "'#{@movie.title}' has no director info"
        redirect_to movies_path
      end
      @movies = @movie.find_with_same_director
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]